# Importacion de librerias

In [1]:
from bokeh.io import output_notebook,show
from bokeh.plotting import figure
import pandas as pd
import numpy as np
import datetime as dt

In [2]:
import Local_funtion as Lf

# Importación de datos

In [3]:
#import bokeh.sampledata
#bokeh.sampledata.download()

In [4]:
children_violenc=pd.read_csv('C:/Users/ferna/Documents/Green Belt/Tableros de gestion/Datasets/childrens_violence new.csv')
Only_Foods=pd.read_csv('C:/Users/ferna/Documents/Green Belt/Tableros de gestion/Datasets/onlinefoods.csv')

In [5]:
Violencia_niños_años=children_violenc.groupby(['Year'])['Childrens Violent Discipline Rate\n\n\n\n\n\n'].sum()
Violencia_niños_años_R=Violencia_niños_años.reset_index()
#Violencia_niños_años_R

In [6]:
Only_Foods

,Age,Gender,Marital Status,Occupation,Monthly Income,Educational Qualifications,Family size,latitude,longitude,Pin code,Output,Feedback,Unnamed: 12
0,20,Female,Single,Student,No Income,Post Graduate,4,12.9766,77.5993,560001,Yes,Positive,Yes
1,24,Female,Single,Student,Below Rs.10000,Graduate,3,12.9770,77.5773,560009,Yes,Positive,Yes
2,22,Male,Single,Student,Below Rs.10000,Post Graduate,3,12.9551,77.6593,560017,Yes,Negative,Yes
3,22,Female,Single,Student,No Income,Graduate,6,12.9473,77.5616,560019,Yes,Positive,Yes
4,22,Male,Single,Student,Below Rs.10000,Post Graduate,4,12.9850,77.5533,560010,Yes,Positive,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...
383,23,Female,Single,Student,No Income,Post Graduate,2,12.9766,77.5993,560001,Yes,Positive,Yes
384,23,Female,Single,Student,No Income,Post Graduate,4,12.9854,77.7081,560048,Yes,Positive,Yes
385,22,Female,Single,Student,No Income,Post Graduate,5,12.9850,77.5533,560010,Yes,Positive,Yes
386,23,Male,Single,Student,Below Rs.10000,Post Graduate,2,12.9770,77.5773,560009,Yes,Positive,Yes
387,23,Male,Single,Student,No Income,Post Graduate,5,12.8988,77.5764,560078,Yes,Positive,Yes

# Prueba de graficos

## Grafico de linea

In [7]:
p=figure()
p.line(children_violenc['Year'],children_violenc['Childrens Violent Discipline Rate\n\n\n\n\n\n'])
p.yaxis.axis_label='Rate'
show(p)

## Grafico de Circulos

In [8]:
p=figure(plot_width=800,plot_height=400)
p.circle(Violencia_niños_años_R['Year'],
         Violencia_niños_años_R['Childrens Violent Discipline Rate\n\n\n\n\n\n'],
        size=10,line_color='navy',fill_color='orange',fill_alpha=0.9)
show(p)

## Grafico de cuadros

In [9]:
p=figure(plot_width=800,plot_height=400)
p.square(children_violenc['Year'],
         children_violenc['Childrens Violent Discipline Rate\n\n\n\n\n\n'],
         size=children_violenc['Childrens Violent Discipline Rate\n\n\n\n\n\n'],color='firebrick',alpha=0.6)
show(p)

## Histograma

In [10]:
#Para realizar el histograma nos apoyaremos de numpy.
q=figure(plot_width=800,plot_height=400)
hist,edges=np.histogram(Only_Foods['longitude'],density=True,bins=20)
q.quad(top=hist,bottom=0,left=edges[:-1],right=edges[1:],
      fill_color='skyblue',line_color='white',legend_label='latitud')
show(q)

# Ejercicio practico con data sets de Bokeh

In [3]:
from bokeh.sampledata.glucose import data

# Cleaning data

In [4]:
#Is important to know what kind of data we have
data.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 52281 entries, 2010-03-24 09:51:00 to 2010-10-10 23:57:00
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   isig     52281 non-null  object
 1   glucose  52281 non-null  int64
dtypes: int64(1), object(1)
memory usage: 1.2+ MB

In [5]:
# For good practice is correct copy the data set, for modify the copy, and don´t touch the original data_set
data_glucose=data.copy()

#We have a problem, the problem is that we have one column, with string, and we want float data
#For this reason we create a function that can covert isig column in float data.
def convert_in_number(data_value):
    try: 
        data_value=float(data_value)
        return data_value
    except:
        data_value=0
        return data_value
data_glucose['isig_value']=data_glucose['isig'].apply(convert_in_number)

In [6]:
# reseteando el indice para poder aplicar las funcion apply scalar
data_glucose=data_glucose.reset_index()
data_glucose.head()

             datetime   isig  glucose  isig_value
0 2010-03-24 09:51:00  22.59      258       22.59
1 2010-03-24 09:56:00  22.52      260       22.52
2 2010-03-24 10:01:00  22.23      258       22.23
3 2010-03-24 10:06:00  21.56      254       21.56
4 2010-03-24 10:11:00  20.79      246       20.79

In [7]:
#Desglosando el HXH.
data_hxh=Lf.apply_scalars(data_glucose,timestamp_col='datetime',hxh=True)

In [8]:
#Reseteando la data, ahora con las columnas que necesitamos para el analisis
data_hxh=data_hxh.set_index('datetime')
data_hxh['DATE']=pd.to_datetime(data_hxh['DATE'])
data_hxh.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 52281 entries, 2010-03-24 09:51:00 to 2010-10-10 23:57:00
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   isig        52281 non-null  object
 1   glucose     52281 non-null  int64
 2   isig_value  52281 non-null  float64
 3   HXH         52281 non-null  object
 4   SHIFT       52281 non-null  object
 5   DATE        52281 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 2.8+ MB

In [11]:
#Agrupando a la tabla por semana
WEEK_DATE=data_hxh.loc['2010-04-06':'2010-05-03']
WEEK_DATE
#table_order_by_date_G=WEEK_DATE.groupby(['DATE'])['glucose'].mean().reset_index()
#table_order_by_date_G.info()

                      isig  glucose  isig_value          HXH SHIFT       DATE
datetime
2010-04-06 00:24:00   8.18       50        8.18  23.5 - 00.5     3 2010-04-05
2010-04-06 00:29:00   8.11       48        8.11  23.5 - 00.5     3 2010-04-05
2010-04-06 00:34:00   7.97       48        7.97  00.5 - 01.5     3 2010-04-05
2010-04-06 00:39:00   7.94       48        7.94  00.5 - 01.5     3 2010-04-05
2010-04-06 00:44:00   8.02       48        8.02  00.5 - 01.5     3 2010-04-05
...                    ...      ...         ...          ...   ...        ...
2010-05-03 23:36:00  13.74      102       13.74  23.5 - 00.5     3 2010-05-03
2010-05-03 23:41:00  13.87      102       13.87  23.5 - 00.5     3 2010-05-03
2010-05-03 23:46:00  13.95      102       13.95  23.5 - 00.5     3 2010-05-03
2010-05-03 23:51:00  13.96      104       13.96  23.5 - 00.5     3 2010-05-03
2010-05-03 23:56:00  13.96      104       13.96  23.5 - 00.5     3 2010-05-03

[6947 rows x 6 columns]

In [129]:
table_order_by_date_G['DATE']=pd.to_datetime(table_order_by_date_G['DATE'],format='%Y-%m-%d')
table_order_by_date_G

        DATE     glucose
0 2010-01-04  109.023256
1 2010-03-24  134.818182
2 2010-03-25  132.090278
3 2010-03-26  106.666667
4 2010-03-27  150.925926
5 2010-03-28  102.743056
6 2010-03-29  153.032787
7 2010-03-30  143.768421
8 2010-03-31  157.584906

In [128]:
# Para graficar con Date times es importante indicarle el tipo de eje a la figura
p=figure(x_axis_type='datetime',title='Glucose',plot_width=800,plot_height=400)
p.xgrid.grid_line_color=None
p.ygrid.grid_line_alpha=0.7
p.xaxis.axis_label='time'
p.yaxis.axis_label='leavel glucose'
p.line(table_order_by_date_G.DATE,table_order_by_date_G.glucose)
show(p)